# метод простих ітерацій
def phi (x): 
     """
     Допоміжна функція для методу простих ітерацій (нормальна форма x = phi(x)).
     """
     return (x**3 + x**2 + 2) / 5

def iteration(a, b, eps):
    """
    Знаходить корінь рівняння методом простих ітерацій.
    Приймає межі відрізка [a, b] та похибку eps.
    Повертає знайдений корінь та кількість ітерацій.
    """
    x_old = (a + b) / 2
    x_new = phi(x_old)
    n = 1
    while abs(x_new - x_old) > eps:
        x_old = x_new
        x_new = phi(x_old)                     
        n = n + 1
    return (x_new, n)
